{
    "url": "https://obenelectric.com/",
    "content": "Electric Bike, E Motorcycle, Ev Two-wheeler Company | Oben Electric\nRorr EZ\nRorr\nLocate Us\nBook Now\nTest Ride\nHome\nRorr EZ\nRorr\nMy Booking\nBlog\nPress\nAbout us\nLocate Us\nBook Now\nTest Ride\nFAQs\nTerms & Condition\nPrivacy Policy\nContact us\nDealership\nIntroductory Price Starting at\n₹ 89,999\n* Ex-Showroom   |  Valid for Limited Period\nBook Now\n1\n2\n3\nApni Rides ko aur Stylish Banao\nRorr EZ Chalao\nExplore Rorr EZ\n1\n2\n3\nMeet the Truly Handsome\nOben Rorr\nJoin a new league of riders who believe in peak electric performance.\n₹ 1,49,999\n(Ex-Showroom Price)\nExplore Rorr\nDesigned in India\nfor the World\nDesign\nBattery\nMotor\nCharging\nConvenience\nConnectivity\nOben Care\nOben Protect\nDesigned to Turn Heads\nA stylish, neo-classic design with retro aesthetics, engineered for superior stability from the ARX frame.\nExplore Now\nBig on Life, High on Safety\nFirst of its kind battery with LFP Cell Technology\n50% Higher heat Resistance\nLong Lasting Durability\nExplore Now\nAlways stay ahead of others\nProprietary IPMSM Motor\nClass-leading torque for unmatched acceleration\nSuperior Riding Experience\nCharge Fast, Ride Far\nCharge anywhere with Oben Port\n0-80% in under 2 hours with Oben Plug\nAccess 12,000+ charging stations nationwide with Oben Net.\nExplore Now\nConvenience on a Motorcycle? Absolutely.\nExperience advanced safety features\nTravel smart with built-in storage and USB charging.\nExplore Now\nStay Connected On The Go\nAnalyze ride data for smarter, safer riding.\nTrack your Rorr theft protection with GPS.\nMonitor vehicle health remotely.\nExplore Now\nThe Oben Assurance\nComprehensive support with Oben Care's 3-year warranty and a fast-growing network of service centers.\nExplore Now\nThe Oben Promise\nEnjoy 5 years or 75,000 km of extended motor & battery warranty with Oben Protect and embrace every journey with peace of mind.\nExplore Now\nOben Rorr EZ\nIndia Rides EZ\nBook Now\nTest Ride\nRorr EZ\nRorr\nSurge Cyan\nLumina Green\nElectro Amber\nPhoton White\nIntroductory Price Starting at\n₹ 89,999\n* Ex-Showroom   |  Valid for Limited Period\nMeet us in\nShowrooms\nPrevious\nJaipur\nBengaluru\nKochi\nPune\nTrivandrum\nDelhi\nHubballi\nLucknow\nMainpuri\nBudaun\nThrissur\nMalappuram\nBilaspur\nComing Soon\nChandigarh\nComing Soon\nBhopal\nComing Soon\nIndore\nComing Soon\nSurat\nComing Soon\nAhmedabad\nJaipur\nBengaluru\nKochi\nPune\nTrivandrum\nDelhi\nHubballi\nLucknow\nMainpuri\nBudaun\nThrissur\nMalappuram\nBilaspur\nComing Soon\nChandigarh\nComing Soon\nBhopal\nComing Soon\nIndore\nComing Soon\nSurat\nComing Soon\nAhmedabad\nJaipur\nBengaluru\nKochi\nPune\nTrivandrum\nDelhi\nHubballi\nLucknow\nMainpuri\nBudaun\nThrissur\nMalappuram\nBilaspur\nComing Soon\nChandigarh\nComing Soon\nBhopal\nComing Soon\nIndore\nComing Soon\nSurat\nComing Soon\nAhmedabad\nNext\n1\n2\nDesigned in India for the World\nOben Electric stands at the forefront of India's electric mobility revolution, manufacturing two-wheelers with global standards in mind. Our electric bikes, Rorr and Rorr EZ, are crafted and manufactured in India, embodying the innovation and craftsmanship of Indian engineering for the world.\nSet apart by a stylish design, superior performance, and innovative battery technology, Oben Electric's Rorr and Rorr EZ promise an exceptional riding experience.\nThe all-new Rorr EZ takes the power of electric bikes one step further with an unbelievable range of 175km IDC, quick acceleration from 0-40km/h in 3.3 seconds, and a top speed of 95 km/h.\nMoreover, with the revolutionary LFP cell tech, 2X longer battery life, and fast charging capabilities, you can ride the electric bike without worrying about the battery running out. Oben Electric is committed to making your rides more sustainable and enjoyable!\nOben Electric Bikes: Roaring Performance, Remarkable Good Looks\nOben Electric has redefined the idea of electric bikes with the Oben Rorr and the newly launched Rorr EZ electric bike model. Embodying the spirit of eco-consciousness, this pioneering electric motorbike allows bikers to enjoy electrifying rides without worrying about increasing carbon emissions.\nWhy choose Oben Electric Bikes?\nElectric bikes are the future, and contributing to a greener tomorrow is just one of the reasons to opt for Oben Electric’s bikes. But there's more.\nAt Oben Electric, we want our customers to enjoy all the thrills of riding a powerful electric motorcycle while\ncontributing to a greener future\n.\nWith that in mind, let us tell you exactly what you stand to gain from choosing Oben Electric’s models.\nUnmatched Performance of Electric Motor Bike\nAre you worried that choosing an EV means missing out on the heavy-duty performance of a standard motorbike? Banish that concern right away! Our expert R&D team has designed the Oben Rorr and the Rorr EZ to make it roar with high performance.\nEquipped with heavy-duty IPMSM motors, our e-bikes are engineered for peak performance.\nBest-In-Class Battery Life of EV Bike\nOne of the key highlights of the Oben Rorr, which impresses EV enthusiasts, is its superior battery life.\nUsing the\nlatest combination of Lithium Iron Phosphate (LFP)\n, the battery life of the Oben Rorr is twice that of the ordinary lithium batteries available on the market. These batteries are a better ecological alternative as well since they limit the use of harmful chemicals such as Nickel and Cobalt.\nLeveraging this modern technology, the Rorr EZ goes an impressive 175 km (IDC) on a single charge while the Oben Rorr pumps out a neat 187 km (IDC).\nAffordable Electric Two Wheelers\nInvesting in one of the best electric bikes in the country, such as the Oben Rorr and the Rorr EZ, is not only a greener decision but also a pocket-friendly one.\nUnlike the ever-mounting fuel prices, electricity costs will get cheaper in the future, saving you big bucks. Additionally, the maintenance cost of electric two-wheeler parts is much lower than that of standard bikes.\nHence, the Oben Rorr offers the benefits of a powerful ignition motorbike without requiring you to spend thousands on its upkeep - a veritable best of both worlds!\nYou can also Read:\nA guide to electric bike prices in India\nEmbrace The Future\nApart from being eco-conscious, the tech team at Oben Electric has gone to great lengths to develop\ncutting-edge features\nthat take your riding experience to the next level.\nThanks to its innovative connect feature, you can run remote diagnostics to track the bike's vitals, get data on your ride history and riding pattern, and spot your vehicle's location with its built-in GPS.\nThe app also hosts a service support option, enabling you to enquire about any issue or raise a service request instantly. Need we say more? Book a\ntest ride\ntoday!\nRead More\nProducts\nRorr EZ\nRorr\nShowroom Cities\nBengaluru\nDelhi\nPune\nKochi\nThiruvananthapuram\nJaipur\nCompany\nAbout Us\nBlogs\nPress\nCareers\nInitiatives\nOben Care\nOben Protect\nOben Net\nSupport\nFAQs\nContact Us\nDealership\nLegal\nTerm & Conditions\nPrivacy Policy\nCancellation & Refund\nDelete App Account\nIndiqube Orion, 24th Main Rd, Agara Village, 1st Sector, HSR Layout, Bengaluru, Karnataka 560102\nEmail us -\nhello@obenelectric.com\nFaceBook\nInstagram\nlinkedin\nyoutube\nCopyright @ Oben Electric 2025. All Rights Reserved."
}